[
    {
        "title": "Ranji Trophy drama: Kerala virtually in final after securing two-run lead over Gujarat",
        "link": "https://indianexpress.com/article/sports/cricket/ranji-trophy-drama-kerala-virtually-in-final-after-securing-two-run-lead-over-gujarat-9848147/?ref=hometop_hp",
        "content": "Streaks of impetuousness and a truckload of nerves were laid bare on the field as Kerala and Gujarat’s block-buster Ranji Trophy semifinal at the Narendra Modi Stadium in Ahmedabad confirmed an outright leader on the fifth morning. With only 28 runs and three wickets to play with, Kerala’s trusted lieutenants Jalaj Saxena and Aditya Sarvate pulled up their socks and lengths to propel their adopted state team towards their first Ranji Trophy final in 74 years since the side first appeared in the prestigious tournament in 1951-52.\nIn their 352nd Ranji appearance, Kerala’s immense resolve under coach Amay Khurasiya and skipper Sachin Baby drafted the golden final berth after the side saw off Gujarat’s lower-order rearguard during the pursuit of a 457-run first-innings score. By securing a two-run first innings lead at the half-way stage of the final day’s play, Kerala virtually secured a place in the final where they are expected to play Vidarbha.\nIt all boiled down to that one run, Kerala’s favoured mind-numbing zone of the season. The same significant one run that Salman Nizar and Nidheesh MD miraculously manufactured in Pune last week. Only a swipe away from securing qualification, No. 10 Arzan Nagwaswalla’s forceful slog-sweep culminated with a symbolic finish – a rebound off their star-batter Salman Nizar’s head at silly point and captain Sachin Baby’s palms at first slip.\nSTORY CONTINUES BELOW THIS AD\nDespite blunting Kerala’s spin advances on day four evening with the admirable measure in defence and running between the wickets, Jaymeet Patel and Siddharth Desai’s fortitude wavered under mounting pressure.\nSTORIES YOU MAY LIKE\nIndian story at the Oscars: Does ‘Anuja’ reinforce Western cliches about poverty in developing nations?\nBJP's win in Delhi has lessons for AAP\nSC on Ranveer Allahbadia: When protector turns prosecutor, citizens should be afraid\nAfter building a chanceless knock throughout on the might of singles, Jaymeet stepped into a reckless zone when he advanced to a loopy Sarvate delivery and chopped the ball to Baby who let a regulation catch off the hooks at cover. Moments later, Jaymeet lunged a touch forward, only to leave a track for wicket-keeper Mohammed Azharuddeen to pursue. Beaten outside off, Azharuddeen’s nimble collection and flick stumped Jaymeet with his backfoot on the line of the crease. An animated Kerala dugout soon emerged on the sidelines with hope reposted with a struggling Sarvate regaining composure.\nChanging ends, the left-arm spinner soon slid one into Desai’s pads with the ball popping up to silly point, prompting the umpire to raise his finger for a catch. Though Desai heaved a sigh of relief after the DRS showed no spikes, the TV umpire Saidarshan Kumar offered a twist with Desai’s feet falling in line of the stumps. Three reds and the southpaw’s 164-ball resistance was packed off with the finish line 11 runs away.\nThe last pair of Nagwaswalla and Priyajitsinh Jadeja held the fort and trickled the deficit before the typical tail-end wantonness kicked into Nagwaswalla’s muscles.\nLalith Kalidas\nFollow\nLalith Kalidas is a Senior Sub-Editor with the sports team of The Indian Express. Working with the online sports desk, Lalith specializes in the happenings on the cricket field, with a particular interest in India's domestic cricket circle. He also carries an affinity towards data-driven stories and often weaves them into cricketing contexts through his analysis. Lalith also writes the weekly stats-based cricket column - 'Stats Corner'. A former cricketer who has played in state-level tournaments in Kerala, he has over three years of experience as a sports journalist. Lalith also covered the 2023 ODI World Cup held in India.\n... Read More"
    },
    {
        "title": "Afforestation funds were spent on iPhones, laptops and building renovation in Uttarakhand, CAG finds",
        "link": "https://indianexpress.com/article/india/afforestation-funds-were-spent-on-iphones-laptops-and-building-renovation-in-uttarakhand-cag-finds-9847379/?ref=hometop_hp",
        "content": "Purchase of iPhones, laptops, fridges and coolers; renovation of buildings; court cases – these were some of the areas where funds allocated for compensatory afforestation were diverted by Uttarakhand’s forest divisions, according to an audit by the Comptroller and Auditor General of India (CAG).\nA CAG report on the functioning of the Compensatory Afforestation Fund Management and Planning Authority (CAMPA) in the 2019-2022 period showed that Rs 13.86 crore was diverted for various activities other than compensatory afforestation – under which forest lands being used for non-forest purposes, like industry or infrastructure development, is mandatorily accompanied by afforestation efforts on at least an equal area of land.\nAs per CAMPA guidelines, after the receipt of funds, afforestation should be conducted within a year, or two growing seasons. However, the report flagged that in 37 cases, compensatory afforestation was executed after more than eight years of getting final clearance. “This resulted in cost escalation of Rs 11.54 crore in raising CA (compensatory afforestation),” the report said.\nSTORY CONTINUES BELOW THIS AD\nThe report also flagged the low survival of the planted trees, which, at 33.51%, is much lower than the mandated 60-65% as per the Forest Research Institute.\nSTORIES YOU MAY LIKE\nIt’s not surprising that Rekha Gupta is BJP’s choice for Delhi Chief Minister\nAmid missing high-profile faces at oath ceremony, two stand out: AAP’s Swati Maliwal and Congress’s Devender Yadav\n‘Sad that woman CM broke her promise to women on first day’: AAP’s Atishi\n“In five divisions, 1,204.04 hectares of land was not suitable for compensatory afforestation. The unsuitability of land shows that the certificates of suitability furnished by the DFOs were incorrect and issued without ascertaining the actual condition of the land. The department did not initiate any action against the DFOs concerned for their negligence,” the report said.\nMeanwhile, the state government also did not discharge interest liability of Rs 275.34 crore from 2019-20 to 2021-22 despite requests from CAMPA, the report said.\nFurther, there was an approved Annual Plan of Operations, which was to be undertaken at an estimated cost of Rs 76.35 crore against which no fund was released to the implementing agencies during the 2019-22 period, according to the report.\nSTORY CONTINUES BELOW THIS AD\nThe CAG report also flagged that the CEO of CAMPA released funds to the forest divisions and implementing agencies without the necessary approval of the Head of Forest Force from July 2020 to November 2021, as directed by the Principal Secretary (Forest) in July 2020.\nThe CAG report recommended that the state authority institute proper budgetary control checks for robust financial management to prevent the diversion or misappropriation of funds.\nThe CAG also flagged instances of unauthorised approvals for forest land diversion by the Uttarakhand government without the central government’s nod as mandated.\n  Aiswarya Raj\nFollow\nAiswarya Raj is a correspondent with The Indian Express who covers South Haryana. An alumna of Asian College of Journalism and the University of Kerala, she started her career at The Indian Express as a sub-editor in the Delhi city team. In her current position, she reports from Gurgaon and covers the neighbouring districts. She likes to tell stories of people and hopes to find moorings in narrative journalism.\n... Read More"
    },
    {
        "title": "Election freebies in mind, as states step up free-ride schemes, losses for State Road Transport units keep mounting",
        "link": "https://indianexpress.com/article/business/election-freebies-free-ride-schemes-state-road-transport-units-loss-9848070/?ref=hometop_hp",
        "content": "The financial condition of the State Road Transport Undertakings (SRTUs) across the country is getting worse, with year-on-year losses mounting to over Rs 30,000 crore in FY22 amid a general decline in fleet utilisation and rising fuel costs, latest government estimates revealed.\nWith more states progressively resorting to transport-linked election freebies, like Delhi, Karnataka, Telangana, Tamil Nadu offering free bus rides to women, these losses could increase unless these units are duly compensated by state government subsidies or through upfront budgetary support.\nThe annual report 2024-25 of the Ministry of Road Transport & Highways (MoRTH) shows that in FY22, the period when bus services got back the momentum after the Covid-19 pandemic, the net loss for 58 SRTUs had surged to Rs 30,191.93 crore, based on latest provisional data. This is an increase of over 68 per cent in three years.\nSTORY CONTINUES BELOW THIS AD\nIn 2020-21, 58 SRTUs reported a total loss of over Rs 29,000 crore. This was primarily because of the Covid-19 pandemic as bus operations were halted for many months. However, even before the pandemic, SRTUs were facing dire financial conditions. The data shows that in 2019-20, 58 SRTUs faced a loss of Rs 20,377.53 crore. Similarly, in 2018-19, 56 SRTUs reported a consolidated net loss of Rs 17,923.92 crore.\nSTORIES YOU MAY LIKE\nSC on Ranveer Allahbadia: When protector turns prosecutor, citizens should be afraid\nRush at Maha Kumbh shows how Hinduism is losing its pluralistic character\nIt’s not surprising that Rekha Gupta is BJP’s choice for Delhi Chief Minister\nAlso Read | On board Delhi’s buses, here’s who working-class women availing free transport support this election\nThe operation of lower number of buses, SRTUs not being able to increase the fare on par with the hike in fuel prices and reduction in occupancy ratio are key reasons for these losses.\n“The net profits/losses vary for each SRTU depending upon underlying operational efficiency parameters such as fleet vintage, fleet utilization, occupancy ratio, staff productivity, etc,” the MoRTH annual report 2024-25 read.\nSRTUs, such as Uttar Pradesh State Road Transport Corporation, Kerala SRTC, Navi Mumbai Municipal Transport, Delhi Transport Corporation etc., are government transport services which operate buses in urban, rural, and hilly areas.\nSTORY CONTINUES BELOW THIS AD\nAmong many factors contributing to losses, the low-fleet utilization rates plague many SRTUs. In 2021-22, the average fleet utilization was 72.29 per cent, meaning a significant number of buses were not in service. According to the report, 58 SRTUs held a total of 1,47,032 buses, out of which 1,06,293 buses were operated.\nSimilarly, the fleet utilization rate in 2020-21, 2019-20 and 2018-19 was 62.54 per cent, 87.56 per cent and 88.6 per cent respectively.\nThe Occupancy Ratio — passenger seat utilization of a bus — is also another major factor for the low revenue of the SRTUs. The report shows that while the occupancy ratio in 2019-20 was 74.03 per cent, it significantly dipped to 68.49 per cent in 2021-22, meaning that lesser people are using government buses.\nSRTUs are also facing increasing operational expenses such as hike in fuel prices, maintenance, and staff salaries. The combined staff strength of the 58 reporting SRTUs was 6,45,954 and the staff-to-bus ratio was 4.39 in 2021-22.\nSTORY CONTINUES BELOW THIS AD\nBesides this, the increased competition from private bus operators and other modes of transportation reduces SRTUs’ revenue.\nDon't Miss | ‘Women are travelling like they are possessed… Where are they going?’: Bus journeys through poll-bound Karnataka\nWhat else does the report reveal?\nThe Ministry’s annual report also shows that while State Transport Units (STUs) are entrusted with the responsibility to make 25% of government-owned public transport vehicles fully accessible (with wheelchair accessibility) to passengers with disabilities, the implementation is far from the target.\nThe data from 61 STUs shows that out of a total 97,165 intercity buses and 48,325 buses for urban operations, only 356 and 10,517 buses respectively have been made “fully accessible”. The number of accessible buses (without wheelchair accessibility) for Intercity and Urban operations are 24,860 and 15,308 respectively.\nThe latest report, which reviews physical and financial performance of SRTUs based on the information supplied by the State Road Transport Undertakings, has been delayed for many years. The latest report is available for the financial year 2018-19 only.\nSTORY CONTINUES BELOW THIS AD\nThe MoRTH annual report said that the publication of the report for the years 2019-20, 2020-21 and 2021-22 is under approval stage.\nDheeraj Mishra\nFollow\nDheeraj Mishra is a Principal correspondent with The Indian Express, Business Bureau. He covers India’s two key ministries- Ministry of Railways and Ministry of Road Transport & Highways. He frequently uses the Right to Information (RTI) Act for his stories, which have resulted in many impactful reports.\n... Read More"
    },
    {
        "title": "How Trump's pro-Russia turn has left Ukraine, Europe 'stunned'",
        "link": "https://indianexpress.com/article/explained/how-trumps-pro-russia-turn-has-left-ukraine-europe-stunned-9847425/?ref=hometop_hp",
        "content": "A well-known saying, frequently attributed to Vladimir Lenin, goes: “There are decades when nothing happens, and there are weeks when decades happen.” This past week could qualify for the latter category.\nOn February 18, a high-level delegation of ministers and officials from the United States and Russia met in Riyadh, Saudi Arabia, for the first in-person contact between Washington and Moscow since Russia invaded Ukraine three years ago.\nAlready a subscriber? Sign in\nYou’re just one step away from accessing this premium story.\nSubscribe Now\nDiscover the Benefits of Our Subscription!\nStay informed with access to our award-winning journalism.\nAvoid misinformation with trusted, accurate reporting.\nMake smarter decisions with insights that matter.\nChoose your subscription package\nRecommended\nAll-Access\nDigital + E-paper subscription so that you don’t miss anything.\nRs.1299/year\nBUY NOW\nDigital-Only\nGet unlimited access to all our journalism online (minus epaper).\nRs.1199/year\nBUY NOW\nMore Premium Stories\nPrevious\nNew Delhi's Qatar opportunity, in trade and geopolitics\nOpposition needs to carve out space for itself\nThree approaches to measuring GDP and why they matter\nNext\nShubhajit Roy\nFollow\nShubhajit Roy, Diplomatic Editor at The Indian Express, has been a journalist for more than 25 years now. Roy joined The Indian Express in October 2003 and has been reporting on foreign affairs for more than 17 years now. Based in Delhi, he has also led the National government and political bureau at The Indian Express in Delhi — a team of reporters who cover the national government and politics for the newspaper. He has got the Ramnath Goenka Journalism award for Excellence in Journalism ‘2016. He got this award for his coverage of the Holey Bakery attack in Dhaka and its aftermath. He also got the IIMCAA Award for the Journalist of the Year, 2022, (Jury’s special mention) for his coverage of the fall of Kabul in August 2021 — he was one of the few Indian journalists in Kabul and the only mainstream newspaper to have covered the Taliban’s capture of power in mid-August, 2021.\n... Read More"
    },
    {
        "title": "From Finance, WCD to Vigilance: Delhi CM Rekha Gupta gets key departments under her belt",
        "link": "https://indianexpress.com/article/cities/delhi/from-finance-wcd-to-vigilance-delhi-cm-rekha-gupta-gets-key-depts-under-her-belt-9847561/?ref=hometop_hp",
        "content": "In a departure from the tenure of the Aam Aadmi Party government led by Arvind Kejriwal, Delhi Chief Minister Rekha Gupta will head 10 departments — Finance, Services, Revenue, Women and Child, and Administrative Reforms Departments, among others.\nKejriwal was attacked by the BJP for not heading any department for most of his tenure and was termed a Chief Minister without a portfolio. He did, however, head the Delhi Jal Board for a short while during his tenure between 2015 and 2020.\nAmong the BJP’s biggest promises is the scheme to give women Rs 2,500 per month, which will be executed by the Women and Child Department.\nSTORY CONTINUES BELOW THIS AD\nDelhi Chief Minister Rekha Gupta during her oath-taking ceremony at Ramlila Maidan. (Express photo by Amit Mehra)\nGupta is also heading the Vigilance department, which, over the past five years, opened several inquiries against AAP ministers. The BJP has promised to set up a Special Investigation Team (SIT) to look into allegations of corruption in the government over the past 10 years.\nSTORIES YOU MAY LIKE\nIt’s not surprising that Rekha Gupta is BJP’s choice for Delhi Chief Minister\nCongress’ Alka Lamba turns back the clock, shares 30-yr-old photo of her and Rekha from DUSU days\n‘Sad that woman CM broke her promise to women on first day’: AAP’s Atishi\nTwo significant portfolios – PWD and water have gone to Parvesh Sahib Singh. The responsibility of the two departments also puts him at the centre of fulfilling major promises made by the BJP in the run-up to the polls.\nOne was to fix the road infrastructure in the city.  According to sources, directions to prepare a plan to repair arterial roads were given soon after the BJP won, even though the Council of Ministers had not been appointed.\nPart of the promise to clean the Yamuna and the riverfront will also be Sahib Singh’s responsibility as water minister. While work related to the Yamuna falls mostly under the Delhi Development Authority, projects such as trapping untreated sewage before it enters the river – a key component of cleaning the river – come under the water department and the Delhi Jal Board. He will also be responsible for ensuring that the problems of residents who have been complaining of getting dirty water at home are addressed.\nSTORY CONTINUES BELOW THIS AD\nKey departments such as education and power, which were at the centre of AAP’s politics and policies, have been given to Ashish Sood. He will also head the Home department.\nVikaspuri MLA Pankaj Kumar Singh, meanwhile, has been allotted the Health & Family Welfare and Transport departments. An assessment has already been ordered by officials into Delhi’s Mohalla Clinics, which will soon be renamed Arogya Mandir, sources said.\nPrime Minister Narendra Modi, Delhi CM Rekha Gupta and Cabinet Ministers greet people at Ramlila Maidan in New Delhi. (Express photo by Amit Mehra)\nRavinder Indraj Singh, the only Dalit face in the Cabinet, has been entrusted with the Social Welfare, SC & ST Welfare, Cooperative Societies and Elections departments. Sources said he will be looking at schemes that were started for Dalit students by AAP but either did not take off or were non-functional to assess the need for revamp.\nAlso Read | ‘From grassroots to campus politics to being Delhi CM’: PM Modi congratulates Rekha Gupta, hails her journey\nThe Sikh face in the Cabinet, Manjinder Singh Sirsa, has been given the Forest & Environment and Industries departments. This will put him in the spotlight, especially in the winter months, when Delhi’s pollution touches toxic levels. The Delhi Pollution Control Committee (DPCC), which keeps a check on Yamuna’s pollution levels and issues challans and fines to industries for failing to meet emission norms, will also come under Sirsa.\nSTORY CONTINUES BELOW THIS AD\nAlso Read | ‘When people can take a dip in Yamuna... it will be a dream come true’: Onlookers at Yamuna Ghat as Delhi CM, Cabinet take part in aarti\nOn Thursday, he was the only one to speak to reporters at the Yamuna’s Vasudev Ghat, where he said that the promises made by the BJP will be fulfilled and excuses will not be made.\nThe only second-time minister in the cabinet, Kapil Mishra, will once again shoulder the responsibility of the Art & Culture, Language and Tourism departments, alongside heading the key departments such as Law & Justice, Labour and Employment.\n "
    },
    {
        "title": "SC on Ranveer Allahbadia: When protector turns prosecutor, citizens should be afraid",
        "link": "https://indianexpress.com/article/opinion/columns/sc-on-ranveer-allahbadia-when-protector-turns-prosecutor-citizens-should-be-afraid-9846375/",
        "content": "Over the last few days, Ranveer Allahbadia’s case has been capturing public imagination. Multiple articles have been written on what the “BeerBiceps” guy said on a YouTube show. Opinion is divided about how such comments should be dealt with by the state. Yet, even the articles defending his right to free speech often contain a caveat that the writer personally found the comments offensive. It seems that the right to free speech has to be preceded by an apology for asking for it.\nIt seems that the Supreme Court thought it should do the same. When Allahbadia moved the Court seeking protection from the multiple FIRs filed against him in various states, the Court did grant him protection — but with conditions. As reported in the papers, the Court orally expressed its gratuitous moral disapproval about the comments. Statements made by judges in court are not binding, of course, but in this day and age, surely, the judges are aware that what they say will be widely reported. This calls for a certain amount of circumspection. But that is another article for another day.\nSTORY CONTINUES BELOW THIS AD\nWhile expressing its view that the comments cause shame to society, the Court also proceeded to impose an extremely unusual condition. It restrained Allahbadia from airing any show till the next date of hearing. It can only be wondered whether the Court knew this would effectively render the YouTuber unemployed and hence, possibly, unable to defend himself (since engaging with the legal system costs money). But that is also not the least of the issues with the order, which is problematic for at least two other reasons. First is its impact on the liberty of all citizens and second is the effect it has on freedom of the press.\nTraditionally understood, the Constitution recognises that a citizen has the right to various freedoms, including the right to free speech. Whenever the legislature or the executive threatens to infringe that right, the courts function as its guardian. The makers of the Constitution imagined that the might of an overbearing state could only be resisted by a powerful court coming to the aid of the powerless citizen. So, an order where the Court restricts free speech flips the constitutional scheme on its head. Where is a citizen to go when her free speech is restricted by the very authority meant to protect it?\nRather than being a neutral umpire in questions relating to the extent of free speech, the Court has become a participant. When the protector turns prosecutor, the delicate balance of power between different institutions of the state falls apart. The ultimate price for this breakdown is paid by citizens through their loss of liberty. Instead of turning to the Court for redress against an overbearing executive, they have to barter some of their freedom to ensure protection. Rights are surely not transactional — the loss of freedom should not be the price for the pursuit of liberty.\nSTORY CONTINUES BELOW THIS AD\nSecondly, the order also has potentially serious ramifications for the freedom of the press. It is fashionable to call YouTubers “content creators”, but in the cacophony of social media, it is easy to forget that there are a host of online platforms offering alternative journalism. It is these sites which offer a counter-narrative to the mainstream reportage. This is something that irks the government (and all political parties) which is itching to control these independent voices. The Court has set a dangerous precedent of passing a gag order on all future content based on an individual show that has offended some people.\nPeople are quick to take offence. It is possible that cases will now be filed against journalists — they will seek not just the removal of “offensive” articles, but a halt on all future reporting. The jurisprudence of the Court was always against any pre-censorship. The order has driven a coach and horses through that principle.\nMOST READ\n1\nRush at Maha Kumbh shows how Hinduism is losing its pluralistic character\n2\nIt’s not surprising that Rekha Gupta is BJP’s choice for Delhi Chief Minister\n3\nPratap Bhanu Mehta writes: BJP’s Delhi challenge and the Capital’s future\n4\nHow a photograph of Gandhi’s kin, taken at Sabarmati Ashram in 1948, helped solve a riddle\n5\nChampions Trophy: India and Pakistan’s refusal to host each other might well be cricket’s greatest tragedy\nThis result will likely please the executive. Taking sanction under the Court’s observations, it is likely to further restrict the rights of citizens. This time the citizens will have nowhere to turn to because it is the Court itself which has initiated the act of restricting the most fundamental of all freedoms.\nGiven how short-lived public memory is, no doubt some other event will overtake this news in the coming weeks. Sadly, the price of this amnesia, this temporary outrage over the restriction on free speech, is a step towards the normalisation of censorship. A nation that can forget the treatment meted out to Munawar Faruqui or the multiple FIRs against journalists or the recurrent social-media hounding of anyone saying anything contrary to the morality of the day is destined to see its freedoms wither away. When the Court becomes party to restricting, rather than protecting free speech, the citizens of the country ought to be afraid indeed.\nThe writer is a senior advocate at the Delhi High Court and is the author of, most recently, Who Is Equal: The Equality Code of the Constitution"
    },
    {
        "title": "BJP's win in Delhi has lessons for AAP",
        "link": "https://indianexpress.com/article/opinion/columns/bjps-win-in-delhi-has-lessons-for-aap-9847455/",
        "content": "In the history of party building in India, the saga of the Aam Aadmi Party’s (AAP) growth will remain an aberration. It essentially emerged out of a “flash mob” movement that metamorphosed into an organisation which defied all descriptions of a classical political party.\nBut the successive decimation of Congress, a legacy party with a rich history of participation in the freedom struggle and near monopoly on the nationalist movement till Independence, is really worrisome. The party had built its organisational structure not by fluke but by dint of hard work and meticulous planning by geniuses like Gopal Krishna Gokhale, Bal Gangadhar Tilak and Mahatma Gandhi.\nSTORY CONTINUES BELOW THIS AD\nIf Gokhale was a modernist with a reformist outlook, Tilak followed the path of tradition and did not hesitate to associate religion with his politics. Gandhi proved to be the biggest mobiliser for the party; he not only opened the party to the masses but also co-opted people from diverse backgrounds to give the organisation dynamism and depth. That was the precise reason Congress contained almost all strands of Indian politics within its fold.\nThe trajectory of Congress’s growth shows that it consistently positioned itself as left of centre after Independence while incorporating within it the broad features of what is now known as Hindutva. It always stood against the language and idioms of regionalism and casteism that came into full play in the late 1960s and led to the party’s marginalisation in certain states. Yet the party stood its ground to prove its nationalist credentials and did not cede space to regional forces. It was the remnants of the organisational legacy that enabled it to return to power in 2004.\nSince 2014, however, the party seems to be not only thoroughly disarrayed organisationally but also acquiring a grammar that was alien to it historically. Take, for instance, the manner in which the party wildly fluctuated from “janeudhari Brahmin” to caste census and “the fight against the Indian state” by way of reinventing its political vocabulary. There is nothing wrong in a political party reorienting itself by rearranging its lexicon and adapting it to the changing times by making conscious choices. But that does not seem to be the case here.\nSTORY CONTINUES BELOW THIS AD\nIf you contrast this with the BJP, you will find it has continued to break regional and social barriers by adapting itself to the new political realities in a rather seamless manner. Mahatma Gandhi and Sardar Vallabhbhai Patel had nothing to do with either the precursors of the BJP or the RSS. They belonged to Congress. Yet they have been fully internalised as icons within the party, so much so that Congress has practically abandoned them. Similarly, Subhas Chandra Bose and B R Ambedkar have been suitably iconised within the BJP’s political narrative irrespective of their political beliefs.\nAt the regional level, the BJP has successfully appropriated the tribal icon Birsa Munda and the Ahom army general Lachit Borphukan and politically sanctified their exalted status. In Uttar Pradesh, Sant Ravidas and Raja Suheldev are similarly iconised to assimilate social sections like the Scheduled Castes and OBCs within the BJP’s fold. In the south, Sant Thiruvalluvar and Bhagwan Basavanna have been included in the BJP’s pantheon for its pan-India expansion.\nMuch like Congress in the pre-Independence period and even during the initial years of the Nehru era, the Bharatiya Jana Sangh — and its successor, the BJP — built its organisational structure brick by brick. It fought for every inch of political space across India. Without losing its ideological moorings, the party shunned stereotypes and maintained remarkable flexibility in its pragmatic politics. When I researched for my book, The Architect of the New BJP: How Narendra Modi Transformed the Party, the BJP came across as a party that innovated new methods of political mobilisation, co-option and expansion of the organisation. That seems to be the reason the BJP has acquired the pole position ,quite akin to what Congress had in the 1950s.\nMOST READ\n1\nRush at Maha Kumbh shows how Hinduism is losing its pluralistic character\n2\nIt’s not surprising that Rekha Gupta is BJP’s choice for Delhi Chief Minister\n3\nSC on Ranveer Allahbadia: When protector turns prosecutor, citizens should be afraid\n4\nPratap Bhanu Mehta writes: BJP’s Delhi challenge and the Capital’s future\n5\nBeyond mangoes and motorcycles: Can India Gain from the US COMPACT?\nA glimpse of that predilection for innovative techniques was visible when Prime Minister Narendra Modi addressed the gathering at the party office after the victory in the Delhi assembly elections. He exhorted over one lakh youth to come forward and join politics to save the country from the politics of dhoortata and murkhata (cunning and foolishness). Rhetoric apart, this exhortation is extraordinary in the sense that it conjured up a dream for the youth to be a part of politics for the cause of nation-building. Despite the victory, the party is not smug; it is indeed keen to set out an agenda to channel the youth’s energy.\nIf one goes back in time, AAP had tapped into the energies of the youth and the restive middle class of the capital to emerge as a viable political option against conventional politics. Driven by a motley group of social activists, it lacked a cohesive political agenda and rose to power by largely mimicking the agitational politics of the past. However, in India’s political history, the evolution of AAP is bound to be a curious case study. That it captured people’s imagination for more than a decade and claimed a significant political space is more a reflection of the conventional polity ceding ground to the deviant. AAP’s chief failure was in building a robust party organisation. In politics, there are bound to be ups and downs, but a party can regain the lost ground if it has a strong organisational back-up. In the Delhi elections, the BJP has proved this.\nThe writer is press secretary to the President of India"
    },
    {
        "title": "Sonu Sood, Tamannaah Bhatia's trainer reveals how much Bollywood celebrities spend on fitness per month",
        "link": "https://indianexpress.com/article/lifestyle/fitness/how-much-bollywood-celebrities-spend-fitness-per-month-sonu-sood-tamannaah-bhatia-trainer-reveals-9814751/",
        "content": "Celebrities are known for their sculpted physiques and high-energy fitness routines, but how much does it actually cost to maintain such a lifestyle?\nIn a recent interview with Lallantop Cinema, celebrity fitness coach Yogesh Bhateja, who has trained stars like Sonu Sood, Tamannaah Bhatia, and Kangana Ranaut, revealed the expenses behind A-lister fitness regimens.\nThe high cost of celebrity fitness\nWhen asked about the monthly expenditure of Bollywood celebrities on fitness, Bhateja revealed that the costs vary widely but can range between ₹2-5 lakh per month. “There is no limit. It can be anywhere between ₹2-5 lakh per month, including their diet,” he said, highlighting the extravagant investments stars make in personal trainers, nutritionists, and gym memberships.\nDiet plays a crucial role in their fitness plans, and many celebrities consume superfoods like blueberries, avocados, and organic proteins, which add to the overall cost, he said. Bhateja further explained that while these foods are beneficial, they are not essential for the average person, stating that affordable substitutes such as pomegranates and eggs can provide similar nutritional value.\nSTORY CONTINUES BELOW THIS AD\nApart from specialised diets, celebrity trainers charge hefty fees. Bhateja estimated that an average celebrity fitness trainer earns around ₹3,000-5,000 per session, depending on factors like their experience, the number of clients they handle, and their training approach.\nSTORIES YOU MAY LIKE\nHow a photograph of Gandhi’s kin, taken at Sabarmati Ashram in 1948, helped solve a riddle\nIt’s not surprising that Rekha Gupta is BJP’s choice for Delhi Chief Minister\nRush at Maha Kumbh shows how Hinduism is losing its pluralistic character\nHigh-end fitness studios and gyms, known for their state-of-the-art equipment, privacy, and luxury services, also contribute to the overall cost. Celebrities often opt for one-on-one training sessions, customised workout programs, and even at-home gym setups to maintain their routines while managing hectic schedules.\nWith the increasing pressure to look a certain way, many celebrities turn to extreme methods for rapid transformations. Bhateja addressed the use of Ozempic for weight loss and the role of steroids in bodybuilding, warning against their adverse health effects. “Losing a lot of weight or building muscle within weeks is not possible naturally. So, if a celebrity and their trainer are using external help, they know the consequences, and there will be ill effects on their health,” he cautioned.\nWhile celebrities invest lakhs in their fitness, Bhateja reassured that staying fit does not require excessive spending. He encouraged people to focus on affordable, nutrient-rich foods and consistent workouts, emphasising that dedication and smart choices matter more than luxury gym memberships or exotic superfoods."
    },
    {
        "title": "Odisha woman allegedly gangraped at gunpoint in front of husband on day they arrived at Tamil Nadu’s Tiruppur for work",
        "link": "https://indianexpress.com/article/cities/chennai/odisha-woman-gangrape-tamil-nadu-tiruppur-9846426/",
        "content": "A 27-year-old woman from Odisha was allegedly gangraped at knifepoint in front of her husband in Tamil Nadu’s Tiruppur city by three migrant workers, including a minor from Bihar, police said. All three accused have been taken into custody.\nAccording to police, the incident took place on Monday night after the woman, her husband and their three-year-old child arrived in Tiruppur the same day in search of work.\nAfter wandering around the city for some time, unsure what to do, the family found themselves near a movie theatre area when the accused approached them, police said.\nSTORY CONTINUES BELOW THIS AD\nThe accused, identified as Mohammad Nadim, 24, Mohammad Danish, 25, and a 17-year-old – all from Bihar – promised the family help in finding employment opportunities, according to an investigating officer.\nSTORIES YOU MAY LIKE\nRush at Maha Kumbh shows how Hinduism is losing its pluralistic character\nIt’s not surprising that Rekha Gupta is BJP’s choice for Delhi Chief Minister\nHow a photograph of Gandhi’s kin, taken at Sabarmati Ashram in 1948, helped solve a riddle\nThey were then taken to a rented room, where the accused offered them a place to stay for the night.\n“After dinner, when the family was resting, the men assaulted the husband, tied him up, and threatened the couple with a knife before raping the woman,” the officer said.\n“The attackers warned the couple against reporting the incident to the police, threatening to kill them if they did, and sent them away that night itself,” he said.\nSTORY CONTINUES BELOW THIS AD\nThe couple filed a complaint at the Tiruppur North all-women police station a few hours later. The police registered a case and arrested the suspects on Tuesday.\nMohammad Nadim and Mohammad Danish were remanded to judicial custody at Coimbatore Central Prison, while the minor was sent to the Coimbatore Juvenile Reformatory School.\nThe survivor is currently receiving treatment at the Tiruppur Government Medical College and Hospital."
    },
    {
        "title": "Miranda House, DU students object to Ziddi Girls, principal demands removal of ‘objectionable’ trailer",
        "link": "https://indianexpress.com/article/cities/delhi/miranda-house-du-students-object-to-ziddi-girls-principal-demands-removal-of-objectionable-trailer-9847538/",
        "content": "Delhi University’s Miranda House has strongly objected to the portrayal of its students in the upcoming Amazon Prime series Ziddi Girls, calling it a misrepresentation that tarnishes the institution’s legacy.\nDirected by Shonali Bose, Ziddi Girls is set in an elite Delhi college named Matilda House, abbreviated as MH, and follows the lives of its students. While the creators maintain that the series is fictional, students and alumni of Miranda House argue that the parallels are unmistakable.\nSpeaking to The Indian Express, Principal Bijayalaxmi Nanda said the college has written to the filmmakers, demanding the removal of the trailer and the show’s reference to ‘MH,” which many believe alludes to Miranda House. “We are deeply shocked and anguished by this portrayal,” Nanda said. “We have demanded that they take down the objectionable trailer and the short-form reference to MH on an urgent basis. If the filmmakers do not respond, we will explore other remedial measures,” Nanda added.\nSTORY CONTINUES BELOW THIS AD\nIn a statement Thursday, the Miranda House students’ union said: “MHSU expresses its deep outrage and profound condemnation over the recent release of the ‘Ziddi Girls’ trailer on Amazon Prime. The circulating trailer contains content that raises serious objections, particularly regarding the dignity of our esteemed institution. It tarnishes, defames, and demeans the 77-year-old legacy of Miranda House, a college renowned for its commitment to women’s education and emancipation.”\nSTORIES YOU MAY LIKE\nIt’s not surprising that Rekha Gupta is BJP’s choice for Delhi Chief Minister\nAmid missing high-profile faces at oath ceremony, two stand out: AAP’s Swati Maliwal and Congress’s Devender Yadav\nRush at Maha Kumbh shows how Hinduism is losing its pluralistic character\n“… the college has formed a committee and has officially sent an email demanding the removal of references to ‘MH’ and ‘Matilda House’ from the trailer, along with the upload of an updated version of the trailer which incorporates the changes required. Additionally, we are actively working on strengthening our policy regarding future shooting within the premises,” it added.\nThe backlash has gained momentum both on campus and online. The Delhi University Students’ Union (DUSU) has called for a boycott of the series, with its president, Ronak Khatri, labeling it a “direct attack on the dignity of Miranda House”.\n“Portraying its students in a sexualised manner is an insult to their academic excellence and hard work,” Khatri said in a statement. “We demand the resignation of the principal who permitted the shooting of this series and call for an immediate ban on its release.”\nSTORY CONTINUES BELOW THIS AD\nStudents have also taken to social media to express their outrage, using hashtags such as #BoycottZiddiGirls and #RespectMirandaHouse. “This is an incorrect representation of our space,” one student wrote on X. “Miranda stands as a stalwart of women’s education and emancipation. It is insulting to our legacy and reputation.”\nAnother student, in a post on X, argued that such portrayals could have real-world consequences: “#ZiddiGirls shows girls’ colleges in a bad way, making it harder for students from smaller cities to convince their parents to let them study in Delhi. As someone studying near Miranda House (Matilda House), I know these colleges are safe and empowering.”\n "
    },
    {
        "title": "Amid missing high-profile faces at oath ceremony, two stand out: AAP’s Swati Maliwal and Congress’s Devender Yadav",
        "link": "https://indianexpress.com/article/cities/delhi/amid-missing-high-profile-faces-at-oath-ceremony-two-stand-out-aaps-swati-maliwal-and-congresss-devender-yadav-9847559/",
        "content": "At the oath-taking ceremony of the Delhi CM and the Council of Ministers at Ramlila Maidan Thursday, top guns of the Bharatiya Janata Party (BJP) were present including Prime Minister Narendra Modi, Home Minister Amit Shah, chief ministers of states led by the party and its alliance partners.\nAmong the high-profile political dignitaries, a face that did not go unnoticed was that of Swati Maliwal, the AAP’s Member of Parliament in the Rajya Sabha. All other AAP leaders skipped the ceremony. Delhi Congress Chief Devender Yadav was also seen on stage, sitting next to Maliwal.\nMaliwal told the media, “I extend my greetings to CM Rekha Gupta ji. The people of Delhi have chosen her with great expectations and I am hopeful that she will meet them.” She also said the CAG reports should be tabled in the Assembly.\nSTORY CONTINUES BELOW THIS AD\nAlso Read | At Ramlila Maidan, wishlist for new CM: ‘Want inflation to be controlled… better roads’\nMaliwal served as the Chairperson of the Delhi Commission for Women (DCW) for seven years till she was nominated as Rajya Sabha MP in January 2024. She was the youngest member of Arvind Kejriwal’s NGO, Parivartan.\nSTORIES YOU MAY LIKE\nRush at Maha Kumbh shows how Hinduism is losing its pluralistic character\nIt’s not surprising that Rekha Gupta is BJP’s choice for Delhi Chief Minister\nSamay Raina jokes about India’s Got Latent row at show in Canada, tells fans ‘thanks for paying my legal fees’: ‘My time maybe bad’\nIn May last year, she ended her long association with Kejriwal in an acrimonious and very public parting, after she alleged his aide Bibhav Kumar assaulted her. The AAP hit back, saying she was acting at the BJP’s behest.\nAlso Read | ‘From grassroots to campus politics to being Delhi CM’: PM Modi congratulates Rekha Gupta, hails her journey\nMonths before the Assembly elections, she had been taking rounds of the Capital to “examine the truth” behind the AAP government’s claims of providing “world-class facilities”.\nAlso Read | From Finance, WCD to Vigilance: Delhi CM Rekha Gupta gets key depts under her belt\nMeanwhile, the Delhi Congress chief also congratulated the newly appointed Chief Minister. “Delhi Congress will extend its full co-operation and support to the new government if it immediately gets down to repair the incalculable damage done to civic infrastructure by Kejriwal and his government, who came to power as a pauper, but went back after swindling taxpayers’ money for his own corruption and comfort.”\nSTORY CONTINUES BELOW THIS AD\nYadav also said Gupta should look at former Chief Minister Sheila Dikshit as a role model.\n "
    },
    {
        "title": "How a photograph of Gandhi’s kin, taken at Sabarmati Ashram in 1948, helped solve a riddle",
        "link": "https://indianexpress.com/article/opinion/columns/photograph-gandhi-kin-congress-meet-1948-solve-riddle-9844634/",
        "content": "This is the remarkable story of how a photo taken 76 years back connected two families across generations and continents.\nThe story has as its central theme the close interactions our late mother Khorshed Wadia Ezekiel (1927-2016) had with the giants of the freedom movement, including and particularly Mahatma Gandhi. And finally, it is a story of how that historic photo solved a mystery in the Gandhi family that went back to the late 1940s when the photo was taken.\nAlready a subscriber? Sign in\nYou’re just one step away from accessing this premium story.\nSubscribe Now\nDiscover the Benefits of Our Subscription!\nStay informed with access to our award-winning journalism.\nAvoid misinformation with trusted, accurate reporting.\nMake smarter decisions with insights that matter.\nChoose your subscription package\nRecommended\nAll-Access\nDigital + E-paper subscription so that you don’t miss anything.\nRs.1299/year\nBUY NOW\nDigital-Only\nGet unlimited access to all our journalism online (minus epaper).\nRs.1199/year\nBUY NOW"
    },
    {
        "title": "Express View on new Delhi CM: Rekha Gupta has her task cut out",
        "link": "https://indianexpress.com/article/opinion/editorials/express-view-on-new-delhi-cm-rekha-gupta-has-her-task-cut-out-9847415/",
        "content": "In her maiden speech as Chief Minister, Rekha Gupta promised to take Delhi to “new heights”. The fourth woman CM of Delhi has a more than two-thirds majority in the assembly and the Centre’s backing. Taking Delhi to “new heights” will demand more — it will require an understanding of the capital’s demographic diversity and its civic issues. Delhi does not merely comprise the middle class or the people living in jhuggis — as electoral campaigns of the dominant parties made it out to be. Beyond these binaries, the capital is a destination for people from different regions of the country who come together to create new spaces, often transcending old divides. Delhi’s development needs to take the aspirations of everyone who has a stake in the city into account.\nThe urge to make Delhi a “world-class” city is not new. The Sheila Dikshit government changed the landscape of the city ahead of the 2010 Commonwealth Games. But the development came at a cost. According to the reports of the Housing and Land Rights Network, between 2004 and 2010, at least 2,00,000 people were evicted from different corners of the city. Many of them were migrants, who gave their sweat and blood to build up the city — they did not get rehabilitation. Delhi is among the very few Indian cities where migration contributes more to population growth than births. To govern such a city, the new government needs to be inclusive. Providing clean air, clean water, sewage systems that work, pothole-free roads and social security, besides continuing its predecessor AAP’s schemes — as promised by the Prime Minister — will be the biggest challenge for Gupta’s administration. AAP had tried to transform the health and education sectors through innovative initiatives like mohalla clinics and the renovation of public schools. Its initial attempts to present corruption-free governance resonated at the grassroots — at least in its first few years. However, the controversy over the liquor scam and allegations of corruption dented the party’s reputation. Governance also suffered because of the Delhi government’s confrontational politics and the Centre’s alleged non-cooperation. The new government has inherited the building blocks. It needs to work on them.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "‘He did this while kids were dying’: Elon Musk digs up Zelenskyy’s old Vogue shoot",
        "link": "https://indianexpress.com/article/world/elon-musk-zelenskyy-vogue-photoshoot-9847564/",
        "content": "Tesla CEO Elon Musk on Thursday criticised Ukrainian President Volodymyr Zelenskyy for participating in a 2022 Vogue photoshoot while the Russia-Ukraine war was ongoing.\nResponding to a post on X featuring the Vogue cover, Musk wrote, “He did this while kids are dying in trenches on the war front.”\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "AR Rahman’s ex-wife Saira hospitalised after medical emergency, expresses gratitude for composer’s ‘unwavering support’",
        "link": "https://indianexpress.com/article/entertainment/music/ar-rahmans-ex-wife-saira-hospitalised-after-medical-emergency-expresses-gratitude-for-composers-unwavering-support-9847853/",
        "content": "Music composer AR Rahman’s ex-wife, Saira Rahman was admitted in a hospital after a medical emergency and had to undergo surgery recently. Her health update was shared online by her legal counsel Vandana Shah. The note also mentioned music composer and sound designer Resul Pookutty and his wife Shadia, as well as her ex-husband AR Rahman’s name for their ‘unwavering support’.\nSaira Rahman’s statement read, “A few days ago Mrs.Saira Rahman was hospitalised due to a medical emergency, and underwent surgery. During this challenging time, her sole focus is on a speedy recovery. She deeply appreciates the concern and support from those around her and requests prayers for her well-being from her numerous well-wishers and supporters.”\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Traffic changes in place on Saturday for Home Minister Amit Shah’s visit",
        "link": "https://indianexpress.com/article/cities/pune/traffic-changes-saturday-home-minister-amit-shah-visit-9847978/",
        "content": "Pune and Pimpri Chinchwad police have notified traffic changes and restrictions on heavy vehicles for Saturday, February 22, for the visit of Union Home Minister Amit Shah.\nHome Minister Shah is slated to attend various programmes in Pune on Saturday which include the meeting of the Western Zonal Council under purview of the Union Ministry of Home Affairs, which will be attended by key functionalities from Maharashtra, Goa, Gujrat, Dadra Nagar Haveli, Daman and Diu. The meeting is going to be held at a hotel in the Koregaon Park. Shah will also preside over a function in Balewadi for the beneficiaries of the Pradhan Mantri Awas Yojana. Both Pune and Pimpri Chinchwad police have notified traffic changes and restrictions on heavy vehicles which will be in force on Saturday.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Rajinikanth-starrer Robot in plagiarism row, ED attaches director Shankar’s assets",
        "link": "https://indianexpress.com/article/cities/chennai/rajinikanth-starrer-robot-in-plagiarism-row-ed-attaches-director-shankars-assets-9847386/",
        "content": "The Directorate of Enforcement (ED) has provisionally attached three immovable properties registered in the name of celebrated filmmaker S Shankar, amounting to a total value of Rs 10.11 crore, under the provisions of the Prevention of Money Laundering Act (PMLA), 2002. The action, taken on February 17, follows a long-standing legal battle over allegations of copyright infringement surrounding Shankar’s 2010 blockbuster film, ‘Enthiran’ (Robot).\nThe ED initiated its investigation based on a complaint filed by writer Aarur Tamilnadan before the 13th Metropolitan Magistrate Court in Egmore, in Chennai city, on May 19, 2011. Tamilnadan’s complaint said that ‘Enthiran’, starring superstar Rajinikanth and Aishwarya Rai, had copied significant elements from his original story, ‘Jiguba’. The allegations extend to violations under the Copyright Act, 1957, and the Indian Penal Code (IPC), 1860.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "How to grow gut microbes: Have green bananas, cooked and cooled rice as they become resistant starch",
        "link": "https://indianexpress.com/article/health-wellness/gut-microbes-green-bananas-cooked-cooled-rice-9847760/",
        "content": "Did you know that cooking and then cooling starchy foods like potatoes, rice, legumes and oats make them even more beneficial for gut health and blood sugar control? That’s because they turn into resistant starch or a complex carbohydrate during cooling, when their molecules rearrange and form a crystalline structure that resists digestion.\nAs a result, resistant starch doesn’t break down in the small intestine and acts like fibre, reaching the colon intact, where it becomes the food for beneficial gut bacteria. And it is because it doesn’t break down easily that it prevents glucose spikes in the body.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Delhi Confidential: Work On The Go",
        "link": "https://indianexpress.com/article/delhi-confidential/delhi-confidential-work-on-the-go-9847509/",
        "content": "Andhra Pradesh Chief Minister N Chandrababu Naidu, who was in the Capital on Thursday to attend oath-taking ceremony of Delhi CM Rekha Gupta, visited Union Agriculture Minister Shivraj Singh Chouhan’s office in Krishi Bhawan and held a meeting with the ministry’s officials. Chouhan, who is travelling to Madhya Pradesh, joined the meeting via video link from his car, it is learnt. Incidentally, Chouhan’s two deputies — Ram Nath Thakur and Bhagirath Choudhary — were also not present when Naidu visited the office to discuss the plight of the state’s chilli farmers. It was a kind of unusual meeting, as CMs generally visit ministry offices to meet Cabinet-rank ministers. A source said the visit was finalised on Wednesday and it was Chouhan’s idea to hold the discussion via videoconferencing from his office.\nOn The Same Side\nThe Supreme Court witnessed some rare bonhomie on Thursday when two usually warring lawyers — Solicitor General Tushar Mehta and Senior Advocate Kapil Sibal — aligned against the January 27, 2025 Lokpal order bringing High Court judges under its purview. Towards the end of the hearing, Sibal remarked, apparently in a lighter vein, “This is a delightful moment for me because we are together.” Justice B R Gavai, who presided over the three-judge bench, chipped in, “fortunately the day starts with a happy note”.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Indian story at the Oscars: Does ‘Anuja’ reinforce Western cliches about poverty in developing nations?",
        "link": "https://indianexpress.com/article/opinion/columns/anuja-oscars-live-action-short-film-poverty-india-western-cliches-9848026/",
        "content": "From a blurred visual, the camera focuses on a hut; in the background, one can see the vague structure of large multi-storeyed buildings, suggesting a place near the city yet distant from it, both literally and metaphorically. It is as if the director wishes to take the urban audience to a world close to them but less appealing, more arduous, and surrounded by fewer means of life. Then, the camera pans to two sisters, laughing and playing in slow motion. The director seems to emphasise the aesthetic sense of the moment by showing the lead character running her fingers across a bricked wall. Suddenly, the scene cuts harshly to a factory, where a man blows a whistle, its sound slicing through the air, demanding, without words, that the women focus on their sewing machines. The camera then moves through a series of establishing shots: Old women with tired hands, young girls with distant eyes, all hunched over their machines, stitching endlessly. Among them are the two sisters, quietly working, just like the rest.\nAnuja, which has been nominated for Best Live Action Short Film at the 97th Academy Awards, is the story of two sisters trapped between a life of limited means they have inherited and an appetite for a fuller life that they both long to experience. The film beautifully captures the nuances of their struggle to break free from their present circumstances.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "As 2 NCP ministers landed in trouble, how Mahayuti govt found itself on the backfoot",
        "link": "https://indianexpress.com/article/political-pulse/ncp-ministers-ajit-pawar-fadnavis-9847823/",
        "content": "Even as the heat on Maharashtra minister and Nationalist Congress Party (NCP) leader Dhananjay Munde over the killing of a sarpanch in Beed district is yet to subside, the NCP headed by Deputy Chief Minister Ajit Pawar has suffered another setback after the Nashik district and sessions court on Thursday convicted state Agriculture Minister and the party’s Sinnar MLA, Manikrao Kokate, in a 30-year-old alleged housing fraud case.\nThe court sentenced Kokate to two years in prison, leaving a cloud of doubt over his ministerial berth and Assembly membership.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "RPSC RAS 2024-25: Over 21,000 candidates crack prelims; scorecard at rpsc.rajasthan.gov.in",
        "link": "https://indianexpress.com/article/education/rpsc-ras-2024-25-prelims-results-out-rpsc-rajasthan-gov-in-ras-mains-dates-sarkari-naukri-9848013/?ref=latestnews_hp",
        "content": "RPSC RAS Prelims Results 2024-25: The Rajasthan Public Service Commission (RPSC) has released the Rajasthan Administrative Service (RAS) prelims results. This year, 21, 539 candidates cracked the prelims round and will now appear for the Mains exam. Candidates who appeared can check their scorecard at rpsc.rajasthan.gov.in using credentials like application number, and date of birth.\nThe RPSC RAS Prelims 2025 took place on Feb 2 from 12 pm to 3 pm, with 3.75 lakh candidates appearing out of the 6.75 lakh who had registered.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Aadar Jain's engagement speech goes viral, says, ‘I have done time pass for four years of my life’; expert on why people stay in such relationships",
        "link": "https://indianexpress.com/article/lifestyle/feelings/aadar-jain-engagement-speech-viral-timepass-relationships-9846321/",
        "content": "Aadar Jain’s wedding festivities with Alekha Advani have been making waves, with the couple celebrating their mehendi ceremony with their family and friends on Wednesday. But, it is his engagement speech that has caught everyone’s attention on social media. \nIn a heartfelt moment, Aadar confessed that he had “always loved” Alekha and had “always wanted to be with her.” However, he humorously mentioned that she had sent him on a “20-year-long journey of time pass” before they finally ended up together. In front of their loved-ones, Aadar said, “I have always loved her since then, and I have always wanted to be with her but never got a chance to be with her. So she sent me on this long journey of 20 years through time-pass. But at the end of the day it was worth the wait because I get to marry this beautiful, beautiful woman, who looks like a dream.”\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "'Did first film with my old nose': Shruti Haasan on cosmetic procedures and owning her choices; what influences such decisions and impact on self-esteem",
        "link": "https://indianexpress.com/article/lifestyle/life-style/shruti-haasan-cosmetic-procedures-owning-choices-self-esteem-body-image-9809647/",
        "content": "Cosmetic procedures and beauty enhancements are often a topic of debate, but Shruti Haasan has always been open about her choices. \nAddressing discussions around her appearance in an interview with Hauterrfly, she shared, “I did get my nose fixed and it was very obvious I got my nose fixed. My nose was broken and quite different before, and I did my first film with my old nose. And then people were like, oh she’s just using the deviated septum excuse. No, I did have a deviated septum, it hurt. But if I could make it prettier, it’s my face, why wouldn’t I? It was that simple. I don’t feel the need to justify why I want to look a certain way for myself. Then they said, ‘Why did you get fillers?’ Yeah I did. And tomorrow, would you get a facelift? Maybe, maybe not. Who knows? It’s my body.”\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "8-year-old boy assaulted for asking woman not to bring dogs inside elevator in Greater Noida society",
        "link": "https://indianexpress.com/article/cities/delhi/greater-noida-society-boy-assaulted-dogs-in-lift-9846466/",
        "content": "The police have arrested a woman after a video of her allegedly dragging and assaulting an eight-year-old boy at a housing society in Greater Noida’s West Gaur City went viral, officials said on Thursday.\nThe incident took place outside the elevator of a residential building in 12th Avenue on Wednesday after the boy requested the woman not to bring her per dogs inside the lift, the police said.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    },
    {
        "title": "Wasim Akram showers praise on Team India captain Rohit Sharma: ‘There is a lazy elegance about him’",
        "link": "https://indianexpress.com/article/sports/cricket/wasim-akram-showers-praise-on-team-india-captain-rohit-sharma-9848067/?ref=latestnews_hp",
        "content": "Legendary Pakistani cricketer Wasim Akram praised Team India captain Rohit Sharma after his brisk knock against Bangladesh in their Champions Trophy opening match at the Dubai International Stadium on Thursday.\nRohit Sharma scored a quick-fire 41 off 36 balls and shared a 69-run opening partnership off 59 balls with centurion Shubman Gill, putting India ahead of the required run rate.\nYou have exhausted your monthly limit of free stories.\nRegister to read more stories\nSign up\nAlready have an account? Sign in"
    }
]